Repository: CofficLab/Lumi
Catalog: Plugins/AppIconDesignerPlugin/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: %d x %d vector document
zh_hans: %d x %d 矢量文档
zh_hk: %d x %d 向量文件

source: %lld × %lld · %lld layers
zh_hans: %lld × %lld · %lld 个图层
zh_hk: %lld × %lld · %lld 個圖層

source: Add
zh_hans: 添加
zh_hk: 新增

source: Add %@
zh_hans: 添加 %@
zh_hk: 新增 %@

source: Add SF Symbol
zh_hans: 添加 SF Symbol
zh_hk: 新增 SF Symbol

source: Add shapes and arrange layers to build your design
zh_hans: 添加形状并排列图层以构建你的设计
zh_hk: 添加形狀並排列圖層以構建你的設計

source: Add text
zh_hans: 添加文字
zh_hk: 新增文字

source: AI-Powered Tools
zh_hans: AI 智能工具
zh_hk: AI 驅動的工具

source: App Icon Designer
zh_hans: 应用图标设计器
zh_hk: App 圖示設計器

# AppIconDesigner Name
source: AppIconDesigner
zh_hans: 应用图标设计器
zh_hk: 应用图标设计器

source: Apply %@
zh_hans: 应用 %@
zh_hk: 套用 %@

source: Apply background color
zh_hans: 应用背景色
zh_hk: 套用背景色

source: Apply fill color
zh_hans: 应用填充色
zh_hk: 套用填滿色

source: Apply gradient background
zh_hans: 应用渐变背景
zh_hk: 套用漸層背景

source: Apply radial background
zh_hans: 应用径向背景
zh_hk: 套用放射背景

source: Apply shadow color
zh_hans: 应用阴影颜色
zh_hk: 套用陰影顏色

source: Apply symbol name
zh_hans: 应用符号名称
zh_hk: 套用符號名稱

source: Apply text
zh_hans: 应用文字
zh_hk: 套用文字

source: Ask the Agent to create an icon document.
zh_hans: 让 Agent 创建一个图标文档
zh_hk: 讓 Agent 建立一個圖示文件

source: Ask the Agent to create or load an icon document.
zh_hans: 让 Agent 创建或加载一个图标文档
zh_hk: 讓 Agent 建立或載入一個圖示文件

source: Background
zh_hans: 背景
zh_hk: 背景

source: Blank Icon
zh_hans: 空白图标
zh_hk: 空白圖示

source: Blur %d
zh_hans: 模糊 %d
zh_hk: 模糊 %d

source: Bold
zh_hans: 粗体
zh_hk: 粗體

source: Bracket motif for coding and system tools.
zh_hans: 适合编码和系统工具的括号图案。
zh_hk: 適合編碼和系統工具的括號圖案。

source: Build complex icons with multiple layers. Control opacity, shadows, blur effects, and transform properties for each layer.
zh_hans: 使用多个图层构建复杂图标。可控制每个图层的不透明度、阴影、模糊效果和变换属性。
zh_hk: 使用多個圖層建構複雜圖示。可控制每個圖層的不透明度、陰影、模糊效果與變形屬性。

source: Build icons with shapes, layers, and presets
zh_hans: 使用形状、图层和预设构建图标
zh_hk: 使用形狀、圖層和預設建構圖示

source: Candidates
zh_hans: 候选项
zh_hk: 候選項

source: Canvas
zh_hans: 画布
zh_hk: 畫布

source: Canvas is not square. App icons work best on a square canvas.
zh_hans: 画布不是正方形。应用图标最适合使用正方形画布。
zh_hk: 畫布不是正方形。App 圖示最適合使用正方形畫布。

source: Capsule
zh_hans: 胶囊
zh_hk: 膠囊

source: Capsules
zh_hans: 胶囊
zh_hk: 膠囊

source: Center X %d
zh_hans: 中心 X %d
zh_hk: 中心 X %d

source: Center Y %d
zh_hans: 中心 Y %d
zh_hk: 中心 Y %d

source: Centered SF Symbol over a vivid gradient.
zh_hans: 鲜明渐变上的居中 SF Symbol。
zh_hk: 鮮明漸層上的置中 SF Symbol。

source: Check Quality
zh_hans: 检查质量
zh_hk: 檢查品質

source: Choose a starting point
zh_hans: 选择起点
zh_hk: 選擇起點

source: Choose export location for Xcode Icon
zh_hans: 选择 Xcode 图标导出位置
zh_hk: 選擇 Xcode 圖示匯出位置

source: Circle
zh_hans: 圆形
zh_hk: 圓形

source: Circles & Ellipses
zh_hans: 圆形和椭圆
zh_hk: 圓形與橢圓

source: Create a new icon document or load an existing one
zh_hans: 新建图标文档或加载已有文档
zh_hk: 建立新的圖示文件或載入現有文件

source: Create app icons with precise vector shapes including rectangles, circles, capsules, triangles, lines, symbols, and text.
zh_hans: 使用精确的矢量形状创建应用图标，包括矩形、圆形、胶囊、三角形、线条、符号和文本。
zh_hk: 使用精確的向量圖形（矩形、圓形、膠囊、三角形、線條、符號與文字）建立應用程式圖示。

source: Create vector icons with shape, color, layer, and export tools.
zh_hans: 用形状、颜色、图层和导出工具创建矢量图标。
zh_hk: 使用形狀、顏色、圖層和匯出工具建立向量圖示。

source: Customize fills, strokes, shadows, and transforms
zh_hans: 自定义填充、描边、阴影和变换
zh_hk: 自訂填色、描邊、陰影與變形

source: Delete
zh_hans: 删除
zh_hk: 刪除

source: Design app icons with shapes, layers, and export capabilities.
zh_hans: 设计应用图标，支持形状、图层和导出功能。
zh_hk: 使用圖形、圖層與匯出功能設計應用程式圖示。

source: Design vector app icons with manual drawing tools, layer controls, and Xcode icon set export.
zh_hans: 使用手动绘制工具、图层控制和 Xcode 图标集导出能力设计矢量应用图标。
zh_hk: 使用手動繪製工具、圖層控制和 Xcode 圖示集匯出能力設計向量 App 圖示。

source: Developer Tool
zh_hans: 开发者工具
zh_hk: 開發者工具

source: Document has no layers. Export will contain only the background.
zh_hans: 文档没有图层。导出结果将只包含背景。
zh_hk: 文件沒有圖層。匯出結果只會包含背景。

source: Duplicate
zh_hans: 复制
zh_hk: 複製

source: Export
zh_hans: 导出
zh_hk: 匯出

source: Export an AppIcon.icon for macOS 15 and later
zh_hans: 导出适用于 macOS 15 及更高版本的 AppIcon.icon
zh_hk: 匯出適用於 macOS 15 及更新版本的 AppIcon.icon

source: Export AppIcon.appiconset
zh_hans: 导出 AppIcon.appiconset
zh_hk: 匯出 AppIcon.appiconset

source: Export as Xcode AppIcon set or SVG
zh_hans: 导出为 Xcode AppIcon 集或 SVG
zh_hk: 匯出為 Xcode AppIcon 套件或 SVG

source: Export SVG
zh_hans: 导出 SVG
zh_hk: 匯出 SVG

source: Export vector graphics in SVG format for web, documentation, or further editing in design tools.
zh_hans: 以 SVG 格式导出矢量图形，用于网页、文档或进一步在设计工具中编辑。
zh_hk: 以 SVG 格式匯出向量圖形，用於網頁、文件或在設計工具中進一步編輯。

source: Export Xcode Icon
zh_hans: 导出 Xcode 图标
zh_hk: 匯出 Xcode 圖示

source: Export your designs as Xcode-ready AppIcon.appiconset with all required sizes for iOS, macOS, and watchOS.
zh_hans: 将设计导出为 Xcode 可用的 AppIcon.appiconset，包含 iOS、macOS 和 watchOS 所需的所有尺寸。
zh_hk: 將設計匯出為可直接用於 Xcode 的 AppIcon.appiconset，包含 iOS、macOS 與 watchOS 所需的全部尺寸。

source: Fill
zh_hans: 填充
zh_hk: 填滿

source: Fill shapes with solid colors, linear gradients, or radial gradients. Add stroke outlines with customizable width and color.
zh_hans: 使用纯色、线性渐变或径向渐变填充形状。可添加可自定义宽度和颜色的描边轮廓。
zh_hk: 以實心色彩、線性漸層或放射狀漸層填滿圖形，並可自訂描邊寬度與顏色。

source: Generate a ready-to-use AppIcon.appiconset
zh_hans: 生成可直接使用的 AppIcon.appiconset
zh_hk: 生成可直接使用的 AppIcon.appiconset

source: Geometry
zh_hans: 几何
zh_hk: 幾何

source: Glass Tile
zh_hans: 玻璃面板
zh_hk: 玻璃面板

source: Gradient Symbol
zh_hans: 渐变符号
zh_hk: 漸層符號

source: Heavy
zh_hans: 特粗
zh_hk: 特粗

source: Height %d
zh_hans: 高度 %d
zh_hk: 高度 %d

source: High contrast ring and luminous glyph.
zh_hans: 高对比圆环与发光字形。
zh_hk: 高對比圓環與發光字形。

source: How It Works
zh_hans: 工作原理
zh_hk: 運作方式

source: Icon document is not exportable. %@
zh_hans: 图标文档无法导出。%@
zh_hk: 圖示文件無法匯出。%@

source: Inspector
zh_hans: 检查器
zh_hk: 檢查器

source: Layer
zh_hans: 图层
zh_hk: 圖層

source: Layer has no useful visible size.
zh_hans: 图层没有有效可见尺寸。
zh_hk: 圖層沒有有效可見尺寸。

source: Layer is nearly transparent.
zh_hans: 图层几乎完全透明。
zh_hk: 圖層幾乎完全透明。

source: Layer Management
zh_hans: 图层管理
zh_hk: 圖層管理

source: Layer scale is extremely small.
zh_hans: 图层缩放非常小。
zh_hk: 圖層縮放非常小。

source: Layered translucent tile for utilities.
zh_hans: 适合工具类应用的分层半透明面板。
zh_hk: 適合工具類 App 的分層半透明面板。

source: Layers
zh_hans: 图层
zh_hk: 圖層

source: Let AI help generate icon presets, apply styling, and lint your designs for best practices.
zh_hans: 让 AI 帮助生成图标预设、应用样式，并检查设计是否符合最佳实践。
zh_hk: 讓 AI 協助產生圖示預設、套用樣式，並依最佳實踐檢查你的設計。

source: Line
zh_hans: 线条
zh_hk: 線條

source: Lines
zh_hans: 线条
zh_hk: 線條

source: Load Document
zh_hans: 载入文档
zh_hk: 載入文件

source: Load document JSON
zh_hans: 载入文档 JSON
zh_hk: 載入文件 JSON

source: macOS 14.0 or later
zh_hans: macOS 14.0 或更高版本
zh_hk: macOS 14.0 或以上

source: Medium
zh_hans: 中等
zh_hk: 中等

source: Minimal Mono
zh_hans: 极简单色
zh_hk: 極簡單色

source: Move backward
zh_hans: 下移一层
zh_hk: 下移一層

source: Move forward
zh_hans: 上移一层
zh_hk: 上移一層

source: Name
zh_hans: 名称
zh_hk: 名稱

source: Neon Ring
zh_hans: 霓虹圆环
zh_hk: 霓虹圓環

source: No icon document selected
zh_hans: 未选择图标文档
zh_hk: 未選擇圖示文件

source: No layers
zh_hans: 没有图层
zh_hk: 沒有圖層

source: Opacity %.2f
zh_hans: 不透明度 %.2f
zh_hk: 不透明度 %.2f

source: Open App Icon Designer from the sidebar to start a new icon.
zh_hans: 从侧边栏打开应用图标设计器来开始设计新图标。
zh_hk: 從側邊欄開啟應用圖示設計器來開始設計新圖示。

source: Output directory
zh_hans: 输出目录
zh_hk: 輸出目錄

# preset.developer-tool.subtitle
source: Bracket motif for coding and system tools.
zh_hans: 适合编码和系统工具的括号图案。
zh_hk: 適合編碼和系統工具的括號圖案。

# preset.developer-tool.title
source: Developer Tool
zh_hans: 开发者工具
zh_hk: 開發者工具

# preset.glass-tile.subtitle
source: Layered translucent tile for utilities.
zh_hans: 适合工具类应用的分层半透明面板。
zh_hk: 適合工具類 App 的分層半透明面板。

# preset.glass-tile.title
source: Glass Tile
zh_hans: 玻璃面板
zh_hk: 玻璃面板

# preset.gradient-symbol.subtitle
source: Centered SF Symbol over a vivid gradient.
zh_hans: 鲜明渐变上的居中 SF Symbol。
zh_hk: 鮮明漸層上的置中 SF Symbol。

# preset.gradient-symbol.title
source: Gradient Symbol
zh_hans: 渐变符号
zh_hk: 漸層符號

# preset.minimal-mono.subtitle
source: Quiet monochrome mark for pro apps.
zh_hans: 适合专业应用的克制单色标记。
zh_hk: 適合專業 App 的克制單色標記。

# preset.minimal-mono.title
source: Minimal Mono
zh_hans: 极简单色
zh_hk: 極簡單色

# preset.neon-ring.subtitle
source: High contrast ring and luminous glyph.
zh_hans: 高对比圆环与发光字形。
zh_hk: 高對比圓環與發光字形。

# preset.neon-ring.title
source: Neon Ring
zh_hans: 霓虹圆环
zh_hk: 霓虹圓環

source: Presets
zh_hans: 预设
zh_hk: 預設

source: Preview your icon at multiple sizes
zh_hans: 在不同尺寸下预览图标
zh_hk: 以多種尺寸預覽你的圖示

source: Quiet monochrome mark for pro apps.
zh_hans: 适合专业应用的克制单色标记。
zh_hk: 適合專業 App 的克制單色標記。

source: Radius %d
zh_hans: 半径 %d
zh_hk: 半徑 %d

source: Rectangle
zh_hans: 矩形
zh_hk: 矩形

source: Rectangles & Rounded Corners
zh_hans: 矩形和圆角
zh_hk: 矩形與圓角

source: Redo
zh_hans: 重做
zh_hk: 重做

source: Regular
zh_hans: 常规
zh_hk: 標準

source: Rename layer
zh_hans: 重命名图层
zh_hk: 重新命名圖層

source: Requirements
zh_hans: 系统要求
zh_hk: 系統需求

source: Rich Fill Options
zh_hans: 丰富的填充选项
zh_hk: 豐富的填色選項

source: Rotate %d
zh_hans: 旋转 %d
zh_hk: 旋轉 %d

source: Save Document
zh_hans: 保存文档
zh_hk: 儲存文件

source: Save document JSON
zh_hans: 保存文档 JSON
zh_hk: 儲存文件 JSON

source: Scale %.1f
zh_hans: 缩放 %.1f
zh_hk: 縮放 %.1f

source: Select a layer to edit it.
zh_hans: 选择一个图层进行编辑。
zh_hk: 選擇一個圖層進行編輯。

source: Semibold
zh_hans: 半粗
zh_hk: 半粗

source: SF Symbol
zh_hans: SF 符号
zh_hk: SF 符号

source: Shadow
zh_hans: 阴影
zh_hk: 陰影

source: Shadow %d
zh_hans: 阴影 %d
zh_hk: 陰影 %d

source: Shadow Y %d
zh_hans: 阴影 Y %d
zh_hk: 陰影 Y %d

source: Size %d
zh_hans: 尺寸 %d
zh_hk: 尺寸 %d

source: Start from a tuned preset or create a blank vector canvas.
zh_hans: 从调好的预设开始，或创建空白矢量画布。
zh_hk: 從已調校的預設開始，或建立空白向量畫布。

source: Supported Shapes
zh_hans: 支持的形状
zh_hk: 支援的圖形

source: SVG Export
zh_hans: SVG 导出
zh_hk: SVG 匯出

source: Swift 6.0 or later
zh_hans: Swift 6.0 或更高版本
zh_hk: Swift 6.0 或以上

source: Symbol
zh_hans: 符号
zh_hk: 符號

source: Symbol layer has an empty symbol name.
zh_hans: 符号图层的符号名称为空。
zh_hk: 符號圖層的符號名稱為空。

source: Symbol size is very small for app icons.
zh_hans: 符号尺寸对应用图标来说太小。
zh_hk: 符號尺寸對 App 圖示來說太小。

source: Text
zh_hans: 文字
zh_hk: 文字

source: Text Labels
zh_hans: 文本标签
zh_hk: 文字標籤

source: Text layer may be unreadable at small icon sizes.
zh_hans: 文字图层在小尺寸图标中可能难以辨认。
zh_hk: 文字圖層在小尺寸圖示中可能難以辨認。

source: Text size is very small for app icons.
zh_hans: 文字尺寸对应用图标来说太小。
zh_hk: 文字尺寸對 App 圖示來說太小。

source: Triangle
zh_hans: 三角形
zh_hk: 三角形

source: Triangles
zh_hans: 三角形
zh_hk: 三角形

source: Undo
zh_hans: 撤销
zh_hk: 還原

source: Untitled Icon
zh_hans: 未命名图标
zh_hk: 未命名圖示

source: Vector drawing
zh_hans: 矢量绘图
zh_hk: 向量繪圖

source: Vector Icon Design
zh_hans: 矢量图标设计
zh_hk: 向量圖示設計

source: Weight
zh_hans: 字重
zh_hk: 字重

source: Width %d
zh_hans: 宽度 %d
zh_hk: 寬度 %d

source: Xcode 15.0+ (for AppIcon export)
zh_hans: Xcode 15.0+（用于 AppIcon 导出）
zh_hk: Xcode 15.0 以上（用於 AppIcon 匯出）

source: Xcode Export
zh_hans: Xcode 导出
zh_hk: Xcode 匯出
